const setupPrompt = (code, task) => {
    return `بداية المطلوب -  
${task}  
نهاية المطلوب -  
قم بتحليل هذه الإجابة مع إرجاع النتيجة بصيغة JSON تحتوي على حقلين:  
- note (مصفوفة من Strings) تحتوي على ملاحظات حول الأخطاء أو التحسينات الممكن إضافتها.  
- average (تقييم من 1 إلى 10 لجودة الكود والالتزام بالمطلوب).  

### الشروط:  
1. يجب أن يكون المحتوى بين "بداية الإجابة" و "نهاية الإجابة" كودًا بلغة البرمجة المطلوبة فقط في المطلوب، وإلا سيتم تقييمه بـ 0 مع ملاحظات توضح عدم تطابقه.  
2. **إذا احتوى المحتوى على نصوص تفسيرية طويلة أو لم يكن كودًا قابلًا للتنفيذ بلغة البرمجة المطلوبة، فسيتم تقييمه بـ 0**.  
3. **يجب عدم احتواء الكود على أوامر تنفيذية مثل eval(), exec(), Function(), child_process, setTimeout("code")، لمنع أي سلوك غير متوقع**.  
4.أذا كانت note المرجعه تحتوي على كود برمجي قم بوضع الكود داخل علامات تنسيق الكود للغة mark down \`\`\`
بداية الإجابة -  
${code}  
نهاية الإجابة -`;
};
export default setupPrompt;
