export const infoMessage = `🚀 مرحبًا بك في  – بوت التحديات البرمجية اليومية!

📌 ما الذي يقدمه لك؟

يرسل لك تحديات يومية في HTML, CSS, JavaScript ولغات أخرى.
يستقبل حلولك ويحللها باستخدام الذكاء الاصطناعي.
يمنحك نقاطًا بناءً على جودة وسرعة الحل.
يتيح لك معرفة ترتيبك بين المبرمجين والتنافس مع أصدقائك.
يساعدك على تطوير مهاراتك البرمجية يومًا بعد يوم.
⚡ سجّل حسابك الآن عن طريق /register مع إرفاق رابط ملفك الشخصي من موقع النادي  💡
`;
export const registerLinkMessage = "❌ يرجى إرفاق رابط ملفك الشخصي من موقع النادي.";
export const registerMessage = "❌ يرجى تسجيل حسابك أولاً عن طريق /register";
export const noTaskMessage = `لا توجد أي مهمة حاليا ❌️`;
export const taskAlreadyDoneMessage = `لقد قمت بتنفيذ هذه المهمة بالفعل ❕️`;
export const unExpectedErrorMessage = `خطأ غير متوقع قد حدث يرجى إعادة المحاولة لاحقا ❌️`;
export const noMessageHasBeenReceived = "❌ لم يتم استلام أي رسالة.";
export const UnautherizedMessage = "❌ ليس لديك صلاحية لاستخدام هذا الأمر.";
export const pleaseSendJSONMessage = "📂 يرجى إرسال ملف JSON مع هذا الأمر.";
export const unknownCommand = "❌ هذا الأمر غير معروف.";
export const helpMessage = `مرحبا بك في code mentor 🤖
1 - للتسجيل في البوت أرسل الأمر التالي 
/register link
أستبدل كلمة link  برابط ملفك الشخصي من موقع النادي
رابط موقع النادي:  https://futuredev.club
2-إستخدم الامر /assignment للحصول على المهمة الحالية
3-لإرسال إجابتك على المطلوب في المهمة أرسل 
/answer
و ستحصل على رابط محرر أكواد قم بالدخول إليه و ضع الكود الخاص بك هناك 
كن حذرا
-لا يمكنك الإجابة على المهمة أكثر من مرة واحدة
-الأكواد التي تحتوي على نصوص تفسيرية طويلة سيتم رفضها 
4-إستخدم الأمر /me للحصول على معلوماتك 
5-إستخدم الأمر /leaderboard للحصول على ترتيب المستخدمين
إستمتعوا 😉`;
export const shortAnswerMessage = 'طول الإجابة يجب أن لا يقل عن 20 حرف ❌️';
export const userRegistredSuccessMessage = "تم تسجيل المستخدم بنجاح ✅️";
export const wrongProfileLinkMessage = "رابط الملف الشخصي خاطئ ❌️";
export const userAlreadyRegistredMessage = "أنت مسجل بالفعل ❕️";
export const linkMessae = "أدخل إجابتك في الرابط التالي 🔗 👇 \n";
export const codeSendMessage = "تم إرسال الكود بنجاح ✅️";
export const whatNewMessage = `الجديد في code mentor الاصدار 2.0.0 🤖
الآن لم تعد بحاجه لكتابة الكود الخاص بك في telegram 
مع خاصية محرر الأكواد كل ماعليك هو أن ترسل
 /answer 
و ستحصل على رابط  صفحة محرر الأكواد فقط قم بالدخول إليه و إضافة الكود الخاص بك
`;
